== Introduction

Couchbase Shell is fully featured, so it does not only contain commands related to couchbase but is actually built on top of a general purpose shell called https://www.nushell.sh/[nushell]. This allows you to interact with the file system or any other command available on your machine, making it a great tool for both operational and development tasks on top of Couchbase.

The following introduction only touches on the basic concepts to make you productive quickly. We recommend also checking out the great https://www.nushell.sh/documentation.html[nushell documentation] so you can get the most out of it.

=== Navigating the Shell

Commands take inputs and produce output in a structured manner, most often represented as tables. Note how both the generic `ls` command and the couchbase-specific `buckets get` command both produce a table as their output:

```
❯ ls
────┬──────────────┬──────┬──────────┬──────────────
 #  │ name         │ type │ size     │ modified
────┼──────────────┼──────┼──────────┼──────────────
  0 │ CHANGELOG.md │ File │    977 B │ 3 hours ago
  1 │ Cargo.lock   │ File │ 133.8 KB │ 6 hours ago
  2 │ Cargo.toml   │ File │   1.6 KB │ 3 hours ago
  3 │ LICENSE      │ File │  11.4 KB │ 2 months ago
  4 │ README.md    │ File │   6.3 KB │ 3 hours ago
  5 │ docs         │ Dir  │    288 B │ 27 mins ago
  6 │ examples     │ Dir  │     96 B │ 2 months ago
  7 │ jupyter      │ Dir  │    128 B │ 2 weeks ago
  8 │ src          │ Dir  │    224 B │ 3 hours ago
  9 │ target       │ Dir  │    192 B │ 2 months ago
 10 │ ui-assets    │ Dir  │    832 B │ 3 weeks ago
────┴──────────────┴──────┴──────────┴──────────────
```

```
> buckets get
───┬─────────┬──────────────────────────────────────┬───────────┬──────────┬───────────┬───────────────┬──────────────────────
 # │ cluster │                 name                 │   type    │ replicas │ ram_quota │ flush_enabled │ min_durability_level 
───┼─────────┼──────────────────────────────────────┼───────────┼──────────┼───────────┼───────────────┼──────────────────────
 0 │ local   │ 529dafb7-78d0-4baa-aa33-ba01fbc50af6 │ couchbase │        1 │  100.0 MB │ No            │ none                 
 1 │ local   │ 4b78e6f0-f69d-460b-a698-a46dfe7173c2 │ couchbase │        1 │  100.0 MB │ No            │ none                 
 2 │ local   │ d3a01765-2a66-41e4-b201-a2cea57a23ab │ couchbase │        1 │  100.0 MB │ No            │ none                 
 3 │ local   │ 97568ca9-665d-4949-b343-e2649a741f5a │ couchbase │        1 │  100.0 MB │ No            │ none                 
 4 │ local   │ 181ce90d-19d1-4745-8100-a9d49c59dd02 │ couchbase │        1 │  100.0 MB │ No            │ none                 
 5 │ local   │ 97b23720-a6fc-425e-896c-75cfd07319a1 │ couchbase │        1 │  100.0 MB │ No            │ none                 
 6 │ local   │ beer-sample                          │ couchbase │        1 │  100.0 MB │ No            │ none                 
 7 │ local   │ travel-sample                        │ couchbase │        3 │  100.0 MB │ No            │ none                 
───┴─────────┴──────────────────────────────────────┴───────────┴──────────┴───────────┴───────────────┴──────────────────────
```

You can pipe the output into other commands, for example if you only want to see buckets that have `sample` in their name you can utilize the `where` command:

```
> buckets get | where name =~ "sample"
───┬─────────┬───────────────┬───────────┬──────────┬───────────┬───────────────┬──────────────────────
 # │ cluster │     name      │   type    │ replicas │ ram_quota │ flush_enabled │ min_durability_level 
───┼─────────┼───────────────┼───────────┼──────────┼───────────┼───────────────┼──────────────────────
 0 │ local   │ beer-sample   │ couchbase │        1 │  100.0 MB │ No            │ none                 
 1 │ local   │ travel-sample │ couchbase │        3 │  100.0 MB │ No            │ none                 
───┴─────────┴───────────────┴───────────┴──────────┴───────────┴───────────────┴──────────────────────
```

In a similar fashion you can turn this structured table into other output formats, for example JSON:

```
> buckets get | where name =~ "sample" | to json --pretty 2
[
  {
    "cluster": "local",
    "name": "beer-sample",
    "type": "couchbase",
    "replicas": 1,
    "ram_quota": 100000000,
    "flush_enabled": false,
    "min_durability_level": "none"
  },
  {
    "cluster": "local",
    "name": "travel-sample",
    "type": "couchbase",
    "replicas": 3,
    "ram_quota": 100000000,
    "flush_enabled": false,
    "min_durability_level": "none"
  }
]
```

Exactly this type of composition takes the unix philosophy of "do one thing well" and meshes it together with the idea of flexible structured pipelines. This allows to build powerful compositions that help you in your daily operations with Couchbase, both from a developer or operations point of view.

=== Getting Help

Other than using this documentation for help, each command can be called with `-h` or `--help` to get information about potential flags, arguments and subcommands. Also, some commands provide additional examples.

```
> buckets -h
Perform bucket management operations

Usage:
  > buckets <subcommand> {flags} 

Subcommands:
  buckets config - Shows the bucket config (low level)
  buckets create - Creates a bucket
  buckets drop - Drops buckets through the HTTP API
  buckets flush - Flushes buckets through the HTTP API
  buckets get - Fetches buckets through the HTTP API
  buckets load-sample - Load a sample bucket
  buckets update - Updates a bucket

Flags:
  -h, --help: Display this help message
```

Some commands (like the one above) only act as groupings for subcommands, like `from`, `to` or `doc`. Since they do not serve a purpose on their own, they will render their help output automatically:

```
> doc
Perform document operations against a bucket or collection

Usage:
  > doc <subcommand> {flags} 

Subcommands:
  doc get - Fetches a document through the data service
  doc insert - Insert a document through the data service
  doc remove - Removes a document through the data service
  doc replace - Replace a document through the data service
  doc upsert - Upsert (insert or override) a document through the data service

Flags:
  -h, --help: Display this help message
```

=== The Prompt explained
Couchbase Shell uses a custom, two line prompt to show you exactly in what environment you are working in right now. Since you can connect to different clusters, switch buckets etc. it is important to know what is currently "active". Here is a sample prompt that will greet you when starting the shell:

```
👤 Administrator at 🏠 local in 🛫  travel-sample
>
```

It tells you that your user is `Administrator`, the current active cluster identifier is `local` and the active bucket is `travel-sample`. Note that the emoji for the active bucket changes if you use a regular bucket vs. the sample buckets we ship (if you are curious, try loading the `beer-sample` as well!).

In the second line, your actual user prompt starts.

=== Loading Data into the Shell

If you want to import data into Couchbase, or just load it into the shell for further processing, there are different commands available to help you. Once the data is loaded into the shell it can be sent to one of the couchbase save commands like `doc upsert`. Depending on the structure of the data, you may also need to tweak it a little bit so it can be properly stored.

The `open` command will look at file endings and try to decode it automatically. Imagine a file named `user.json` in your current directy with the following content: `{"name": "Michael", "age": 32}`.

```
> open user.json
──────┬─────────
 name │ Michael 
 age  │ 32      
──────┴─────────
```

As you can see, the `open` command already decoded the JSON document into the tabular format. If the filename would only be `user`, the import would look like this instead:

```
> open user
{"name": "Michael", "age": 32}
```

If you are dealing with data that cannot be decoded automatically, you can use the various `from` subcommands to help with decoding. In our case we use `from json`:

```
> open user | from json
──────┬─────────
 name │ Michael 
 age  │ 32      
──────┴─────────
```

TIP: look at the many different import formats `from` supports, including csv, xml, yaml and even sqlite. With this simple tool at hand you are able to load many different data formats quickly and import them into couchbase!

=== Exporting Data from the Shell

The export counterparts to `open` and `from`, are `save` and `to`. You can use both command to take tabular data from the shell and store it in files of the needed target format.

Like `open`, `save` will try to discern the format from the file ending. The following example will load a JSON file and save it as CSV:

```
> cat user.json
{"name":"Michael","age":32}
```

```
> open user.json | save user.csv
```

```
> cat user.csv
name,age
Michael,32
```

This example is dealing with only one row for simplicity, but you can save as many rows as you need in one file. 

As a motivating example, the following snippet runs a N1QL query and stores the result as a csv file:

```
> query "select airportname,city,country from `travel-sample` where type = 'airport' limit 10" | save output.csv
```

```
> cat output.csv
airportname,city,country
Calais Dunkerque,Calais,France
Peronne St Quentin,Peronne,France
Les Loges,Nangis,France
Couterne,Bagnole-de-l'orne,France
Bray,Albert,France
Le Touquet Paris Plage,Le Tourquet,France
Denain,Valenciennes,France
Glisy,Amiens,France
La Garenne,Agen,France
Cazaux,Cazaux,France
```
